sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c
#include "stdint.h"
#include "stdlib.h"
#include "uart.h"
#include "misc.h"
#include "lcd.h"
#include "delay.h"
#include "gsm.h"
#include "system_LPC17xx.h"
#include "LPC17xx.h"
#include "stdio.h"
#include "syscalls.h"
#include "string.h"
#include "config.h"

Modem_Type_t modem;

/** @brief 
 *  @param 
 *  @return 
 */
void gsm_buff_init(void)
{
	/* allocate memory */
	modem.tcpstatus 	= (char *) malloc(32);
	modem.setapn 		= (char *) malloc(64);
	modem.getapn 		= (char *) malloc(64);
	modem.operator_name = (char *) malloc(64);
	modem.ip_addr 		= (char *) malloc(32);
	modem.httpheader 	= (char *) malloc(512);
	modem.httpdata 		= (char *) malloc(1024);
}

int8_t process_response(char * ptr, uint16_t len)
{
	if(isblankstr(uart3_fifo.line, len))
	{
		return __LINE_BLANK;
	}

	// Check for data
	else if(memchr(ptr, '+', len) && memchr(ptr, ':', len))
	{
		if(strstr(uart3_fifo.line, "+CPIN") || strstr(uart3_fifo.line, "+CFUN"))
		{
			return __LINE_START_OTHER;
		}
		return __LINE_DATA;
	}

	// Check for errors
	else if(strstr(ptr,"ERROR") != NULL)
	{
		return __LINE_ERROR;
	}

	// otherwise 
	else
	{
		if(strstr(uart3_fifo.line, "RDY"))
		{
			return __LINE_START_RDY;
		}
		else if(strstr(uart3_fifo.line, "Call Ready"))
		{
			return __LINE_START_CRDY;
		}
		return __LINE_OTHER;
	}
}

/** @brief 		Send AT to modem and checks for OK
 *  @param 		void
 *  @return 	int8_t
 */
int8_t gsm_ping_modem(void)
{
	uint16_t len, resp;

	/* write AT to modem */
	modem_out("AT\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	// read 2nd line it should contain 'OK'
	len = modem_readline();

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		if(strstr(uart3_fifo.line, "OK"))
		{
			return __LINE_PARSE_SUCCESS;
		}
		else
		{
			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}

	modem_flush_rx();
	return __MODEM_LINE_NOT_OTHER;
}

/** @brief 		Send AT+CIPS to modem and stores the result in given struct
 *  @param 		int8_t
 *  @return 	int8_t
 */
int8_t gsm_get_tcpstatus(Modem_Type_t * t)
{
	uint16_t len, resp;

	/* write AT+CIPSTATUS to modem */
	modem_out("AT+CIPSTATUS\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should contain 'OK' */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __LINE_OTHER */
	if(resp == __LINE_OTHER)
	{
		/* Search for OK */
		if(strstr(uart3_fifo.line, "OK") == NULL)
		{
			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}

	/* If it's not __LINE_OTHER */
	else
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	
	/* read 3rd line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank line */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}


	/* read 1st line it should contain TCPSTATUS */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for  __LINE_OTHER*/
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* Search for char : */
	char * __index = memchr(uart3_fifo.line, ':', len);

	/* Check result */
	if(__index == NULL)
	{
		modem_flush_rx();
		return __MODEM_LINE_CS_ERROR;
	}

	/* +2 for removing :<space> */
	__index += 2;

	/* find the length of string */
	uint8_t __indexlen 	= strlen(__index);

	/* copy string to struct */
	memcpy(t->tcpstatus, __index, __indexlen);

	/* return SUCCESS */
	return __LINE_PARSE_SUCCESS;
}

/** @brief 		Send AT+CSQ to modem and get the signal strength stores result in struct
 *  @param 		Modem_Type_t
 *  @return 	int8_t
 */
int8_t gsm_get_rssi(Modem_Type_t * t)
{
	uint16_t len, resp;

	/* write AT+CIPSTATUS to modem */
	modem_out("AT+CSQ\r");

	/* read 1st line it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank if not return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should be contain data */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check whether response is data? */
	if(resp != __LINE_DATA)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_DATA;
	}

	char * __next;
	char * __index = index(uart3_fifo.line, ':');

	/* check for result and returns error */
	if(__index == NULL)
	{
		modem_flush_rx();
		return __MODEM_LINE_CS_ERROR;
	}

	/* +2 for removing :<space> */
	__index += 2;

	int8_t rssi = strtol(__index, &__next, 10);

	if(rssi == -1)
	{
		modem_flush_rx();
		return __MODEM_LINE_PARSE_ERROR;
	}

	t->rssi = rssi;

	/* read 3rd line it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	// check whether blank line
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}


	/* read 3rd line it should be 'OK' */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* check for 'OK' */
	if(strstr(uart3_fifo.line, "OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;
	}

	modem_flush_rx();
	return __MODEM_LINE_NOT_OK;
}

/** @brief 		Send AT+CSTT=\"APN\" to modem and check for response 'OK'
 *  @param 		Modem_Type_t (setapn should be set to accesspoint name before calling this function)
 *  @return 	int8_t
 */
int8_t gsm_set_accesspoint(Modem_Type_t * t)
{
	uint16_t len, resp;

	/* check whether struct contain valid apn */
	if(strlen(t->setapn) == 0)
		return __PARAM_PASS_VALUE_ERROR;

	/* register access point */
	modem_out("AT+CSTT=\"");
	modem_out(t->setapn);
	modem_out("\"\r");

	/* read 1st line and it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	
	/* read 2nd line it should contain 'OK' */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

