sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c
	/* search for 'OK' */
	if(strstr(uart3_fifo.line, "OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;
	}

	/* otherwise returns error */
	modem_flush_rx();
	return __MODEM_LINE_NOT_OK;
}

/** @brief 		Send AT+CSTT? to modem and gets the accesspoint name (After success it fills name to struct->getapn)
 *  @param 		Modem_Type_t
 *  @return 	int8_t
 */
int8_t gsm_get_accesspoint(Modem_Type_t * t)
{
	uint16_t len, resp;

	/* send AT+CSTT? to modem */
	modem_out("AT+CSTT?\r");

	/* read 1st line and it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank if not returns error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should have __DATA */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	if(resp != __LINE_DATA)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_DATA;
	}
	
	/*  search for characters to parse apn name 
		example line: <CR><LF>+CSTT: "TATA.DOCOMO.INTERNET","",""<CR><LF>
	*/
	char * __index = memchr(uart3_fifo.line, ':', len);
	char * __comma = memchr(uart3_fifo.line, ',', len);

	if(__index == NULL || __comma == NULL)
	{
		modem_flush_rx();
		return __MODEM_LINE_CS_ERROR;
	}

	// to remove :<space>'"' "
	__index += 3;

	// To remove '"' 
	__comma -= 1;

	uint8_t _index_len = strlen(__index);
	uint8_t _comma_len = strlen(__comma);

	memcpy(t->getapn, __index , _index_len - _comma_len);
		
	/* read 3rd line it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank if not returns error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 4th line it should contain 'OK' */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* search for 'OK' */
	if(strstr(uart3_fifo.line, "OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;
	}

	/* otherwise returns error */
	modem_flush_rx();
	return __MODEM_LINE_NOT_OK;
}

/** @brief 		Send AT+COPS? to modem and stores operator name in struct->operator_name
 *  @param 		Modem_Type_t
 *  @return 	int8_t
 */
int8_t gsm_get_operator_name(Modem_Type_t * t)
{
	uint16_t len, resp;

	/* send AT+COPS? to modem */
	modem_out("AT+COPS?\r");

	/* read 1st line and it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank if not returns error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}


	/* read 2nd line it should contain __DATA */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __DATA if not found return error */
	if(resp != __LINE_DATA)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* search for character
	   example line: +COPS: 0,0,"T24"
	*/
	char * __index = memchr(uart3_fifo.line, '"', len);

	

	if(__index == NULL)
	{
		modem_flush_rx();
		return __MODEM_LINE_CS_ERROR;
	}

	/* to remove :<space>'"' " */
	__index += 1;

	/* find string length */
	uint8_t _index_len = strlen(__index);

	/* copy operator name to struct */
	memcpy(t->operator_name, __index , _index_len - 3);
	
	/* read 3rd line and it should be blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for blank if not returns error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 4th line it should contain 'OK' */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* search for 'OK' */
	if(strstr(uart3_fifo.line, "OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;
	}

	/* otherwise returns error */
	modem_flush_rx();
	return __MODEM_LINE_NOT_OK;
}

/** @brief 		Send AT+CIICR to modem and checks for 'OK' after success modem should get ip address
 *  @param 		void
 *  @return 	int8_t
 */
int8_t gsm_start_gprs(void)
{
	uint16_t len, resp;

	/* write AT+CIICR to modem */
	modem_out("AT+CIICR\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	// read 2nd line it should contain 'OK'
	len = modem_readline();

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		if(strstr(uart3_fifo.line, "OK"))
		{
			return __LINE_PARSE_SUCCESS;
		}
		else
		{
			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}

	modem_flush_rx();
	return __MODEM_LINE_NOT_OTHER;
}

/** @brief 		Send AT+CIFSR to modem and checks for IP address if found returns success and stores in struct->ip_addr
 *  @param 		Modem_Type_t
 *  @return 	int8_t
 */
int8_t gsm_get_ip_address(Modem_Type_t * t)
{
	uint16_t len, resp;

	// send 'AT+CIFSR'
	modem_out("AT+CIFSR\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should contain IP address */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	if(strstr(uart3_fifo.line, "ERROR"))
	{
		modem_flush_rx();
		return __MODEM_UNKNOWN_ERROR;
	}
	else
	{
		if(memchr(uart3_fifo.line,'.',len))
		{
			strcpy(t->ip_addr, uart3_fifo.line);
			modem_flush_rx();
			return __LINE_PARSE_SUCCESS;
		}
	}
	return __MODEM_LINE_PARSE_ERROR;
}

/** @brief 		Send AT+CIPCLOSE to modem and checks for 'OK'
 *  @param 		void
 *  @return 	int8_t
 */
int8_t gsm_tcp_disconnect(void)
{
	uint16_t len, resp;

	/* send AT+CIPCLOSE to modem */
	modem_out("AT+CIPCLOSE\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should contain __DATA */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	if(strstr(uart3_fifo.line, "CLOSE OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;	
	}

	modem_flush_rx();
	return __MODEM_LINE_PARSE_ERROR;
}

// TODO: Connection timeout has to set
/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_tcp_connect(char * host, char * port)
{
	uint16_t len, resp;

	// send 'AT'
	modem_out("AT+CIPSTART=\"TCP\",\"");
	modem_out(host);
	modem_out("\",");
	modem_out(port);
	modem_out("\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

