sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c
	/* read 2nd line it should contain __OTHER */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	/* search for 'OK' */
	if(strstr(uart3_fifo.line, "OK") == NULL)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OK;
	}

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}	

	/* read 2nd line it should contain __OTHER */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	if(strstr(uart3_fifo.line, "CONNECT OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

/** @brief 		Send AT+CIPCLOSE to modem and checks for 'OK'
 *  @param 		void
 *  @return 	int8_t
 */
int8_t gsm_tcp_shutdown(void)
{
	uint16_t len, resp;

	/* send AT+CIPCLOSE to modem */
	modem_out("AT+CIPSHUT\r");

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	/* read 2nd line it should contain __DATA */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* check for __OTHER if not found return error */
	if(resp != __LINE_OTHER)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_OTHER;
	}

	if(strstr(uart3_fifo.line, "SHUT OK"))
	{
		modem_flush_rx();
		return __LINE_PARSE_SUCCESS;	
	}

	modem_flush_rx();
	return __MODEM_LINE_PARSE_ERROR;
}

/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_send(char c)
{
	/* send AT+CIPSEND to modem */
	modem_out("AT+CIPSEND\r");

	// CAUTION: Blocking
	while(uart3_fifo.num_bytes == 0);

	if(modem_getc() == c)
		return 1;

	return -1;	
}

/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_http_head(char * host, char * path)
{
	uint8_t state, resp;
	uint16_t len;
	char buff[10];

	if(gsm_tcp_connect(host, "80"))
	{
		if(gsm_send('>'))
		{

			/* request type */
			modem_out("HEAD ");
			modem_out(path);
			modem_out(" HTTP/1.1\r\n");

			/* host name */
			modem_out("Host: ");
			modem_out(host);
			modem_out("\r\n");

			/* content type */
			modem_out("Content-Type: application/json\r\n");

			/* acceptance type */
			modem_out("Accept: application/json\r\n");

			modem_out("\r\n");

			// Send completed command
			modem_putc(0x1A);

			/* read 1st line it should blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* if it's not blank return error */
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}

			/* read 2nd line it should contain 'SEND OK' */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for __OTHER if not found return error */
			if(resp != __LINE_OTHER)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_OTHER;
			}

			if(strstr(uart3_fifo.line, "SEND OK"))
			{
					modem_flush_rx();
					return __LINE_PARSE_SUCCESS;
			}
		}
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_http_get(char * host, char * path)
{
	uint8_t state, resp;
	uint16_t len;
	char buff[10];

	if(gsm_tcp_connect(host, "80"))
	{
		if(gsm_send('>'))
		{

			/* request type */
			modem_out("GET ");
			modem_out(path);
			modem_out(" HTTP/1.1\r\n");

			/* host name */
			modem_out("Host: ");
			modem_out(host);
			modem_out("\r\n");

			/* content type */
			modem_out("Content-Type: application/json\r\n");

			/* acceptance type */
			modem_out("Accept: application/json\r\n");

			modem_out("\r\n");

			/* Send completed command */
			modem_putc(0x1A);

			/* read 1st line it should blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* if it's not blank return error */
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}

			/* read 2nd line it should contain 'SEND OK' */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for __OTHER if not found return error */
			if(resp != __LINE_OTHER)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_OTHER;
			}

			if(strstr(uart3_fifo.line, "SEND OK"))
			{
					//modem_flush_rx();
					return __LINE_PARSE_SUCCESS;
			}
		}
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_http_put(char * host, char * path, char * dat)
{
	uint8_t state, resp;
	uint16_t len;
	char buff[10];

	if(gsm_tcp_connect(host, "80"))
	{
		if(gsm_send('>'))
		{
			// /* request type */
			// modem_out("PUT ");
			// modem_out(path);
			// modem_out(" HTTP/1.1\r\n");

			// /* host name */
			// modem_out("Host: ");
			// modem_out(host);
			// modem_out("\r\n");

			// /* content type */
			// modem_out("Content-Type: application/json\r\n");

			// /* acceptance type */
			// modem_out("Accept: application/json\r\n");

			// modem_out("\r\n");

			// /* Content Length */
			// modem_out("Content-Length: ");
			// sprintf(tbuff, "%d", strlen(dat));
			// modem_out(tbuff);

			// modem_out("\r\n\r\n");
			// modem_out(dat);
			// modem_out("\r\n\r\n");

			// /* Send completed command */
			// modem_putc(0x1A);

			modem_out("PUT ");
			modem_out(path);
			modem_out(" HTTP/1.1\r\n");
			// 2nd line
			modem_out("Host: ");
			modem_out(host);
			modem_out("\r\n");
			// 3rd line
			modem_out("Content-Type: application/json\r\n");
			// 4th line
			modem_out("Accept: application/json\r\n");
			// 5th line
			modem_out("Content-Length: ");
			sprintf(buff, "%d", strlen(dat));
			modem_out(buff);
			modem_out("\r\n\r\n");
			modem_out(dat);
			modem_out("\r\n\r\n");
			// Send
			modem_putc(0x1A);

			/* read 1st line it should blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* if it's not blank return error */
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}

