sriharshaq/LPC1768-FreeRTOS-SIM900/drivers/gsm.c
			/* read 2nd line it should contain 'SEND OK' */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for __OTHER if not found return error */
			if(resp != __LINE_OTHER)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_OTHER;
			}

			if(strstr(uart3_fifo.line, "SEND OK"))
			{
					//modem_flush_rx();
					return __LINE_PARSE_SUCCESS;
			}
		}
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_http_post(char * host, char * path, char * dat)
{
	uint8_t state, resp;
	uint16_t len;
	char buff[10];

	if(gsm_tcp_connect(host, "80"))
	{
		if(gsm_send('>'))
		{

			/* request type */
			modem_out("POST ");
			modem_out(path);
			modem_out(" HTTP/1.1\r\n");

			/* host name */
			modem_out("Host: ");
			modem_out(host);
			modem_out("\r\n");

			/* content type */
			modem_out("Content-Type: application/json\r\n");

			/* acceptance type */
			modem_out("Accept: application/json\r\n");

			modem_out("\r\n");

			/* Content Length */
			modem_out("Content-Length: ");
			sprintf(buff, "%d", strlen(dat));
			modem_out(buff);

			modem_out("\r\n\r\n");
			modem_out(dat);
			modem_out("\r\n\r\n");

			/* Send completed command */
			modem_putc(0x1A);

			/* read 1st line it should blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* if it's not blank return error */
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}

			/* read 2nd line it should contain 'SEND OK' */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for __OTHER if not found return error */
			if(resp != __LINE_OTHER)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_OTHER;
			}

			if(strstr(uart3_fifo.line, "SEND OK"))
			{
					//modem_flush_rx();
					return __LINE_PARSE_SUCCESS;
			}
		}
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

/** @brief 		Send AT+CIPSTART to modem and checks for 'CONNECT OK'
 *  @param 		host, port (strings)
 *  @return 	int8_t
 */
int8_t gsm_http_delete(char * host, char * path)
{
	uint8_t state, resp;
	uint16_t len;

	if(gsm_tcp_connect(host, "80"))
	{
		if(gsm_send('>'))
		{

			/* request type */
			modem_out("DELETE ");
			modem_out(path);
			modem_out(" HTTP/1.1\r\n");

			/* host name */
			modem_out("Host: ");
			modem_out(host);
			modem_out("\r\n");

			/* content type */
			modem_out("Content-Type: application/json\r\n");

			/* acceptance type */
			modem_out("Accept: application/json\r\n");

			modem_out("\r\n");

			/* Send completed command */
			modem_putc(0x1A);

			/* read 1st line it should blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* if it's not blank return error */
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}

			/* read 2nd line it should contain 'SEND OK' */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for __OTHER if not found return error */
			if(resp != __LINE_OTHER)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_OTHER;
			}

			if(strstr(uart3_fifo.line, "SEND OK"))
			{
					//modem_flush_rx();
					return __LINE_PARSE_SUCCESS;
			}
		}
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

int8_t gsm_set_text_mode(uint8_t _mode)
{
	uint16_t len, resp;

	/* write AT to modem */
	modem_out("AT+CMGF=");
	modem_putc(_mode + 48);
	modem_putc('\r');

	/* read 1st line it should blank */
	len 	= modem_readline();
	resp 	= process_response(uart3_fifo.line,len);

	/* if it's not blank return error */
	if(resp != __LINE_BLANK)
	{
		modem_flush_rx();
		return __MODEM_LINE_NOT_BLANK;
	}

	// read 2nd line it should contain 'OK'
	len = modem_readline();

	resp = process_response(uart3_fifo.line,len);

	if(resp == __LINE_OTHER)
	{
		if(strstr(uart3_fifo.line, "OK"))
		{
			return __LINE_PARSE_SUCCESS;
		}
		else
		{
			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}

	modem_flush_rx();
	return __MODEM_LINE_NOT_OTHER;	
}

int8_t gsm_send_sms(char * num, char * msg)
{
	uint16_t len, resp;

	if(gsm_set_text_mode(1))
	{
		/* write AT to modem */
		modem_out("AT+CMGS=\"");
		modem_out(num);
		modem_out("\"\r");

		if(gsm_send('>'))
		{
			modem_out(msg);
			modem_putc(0x1A);	

			/* read 1st line it should be blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for blank if not return error */
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}

			/* read 2nd line it should be contain data */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check whether response is data? */
			if(resp != __LINE_DATA)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_DATA;
			}

			char * __next;
			char * __index = index(uart3_fifo.line, ':');

			/* check for result and returns error */
			if(__index == NULL)
			{
				modem_flush_rx();
				return __MODEM_LINE_CS_ERROR;
			}

			/* +2 for removing :<space> */
			__index += 2;

			int8_t loc = strtol(__index, &__next, 10);

			modem.lastsmsloc = loc;

			/* read 3rd line it should be blank */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			// check whether blank line
			if(resp != __LINE_BLANK)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_BLANK;
			}


			/* read 3rd line it should be 'OK' */
			len 	= modem_readline();
			resp 	= process_response(uart3_fifo.line,len);

			/* check for __OTHER */
			if(resp != __LINE_OTHER)
			{
				modem_flush_rx();
				return __MODEM_LINE_NOT_OTHER;
			}

			/* check for 'OK' */
			if(strstr(uart3_fifo.line, "OK"))
			{
				modem_flush_rx();
				return __LINE_PARSE_SUCCESS;
			}

			modem_flush_rx();
			return __MODEM_LINE_NOT_OK;
		}
	}
	modem_flush_rx();
	return __MODEM_UNKNOWN_ERROR;
}

void http_read_data(Modem_Type_t * t)
{
	uint16_t len;
	len = modem_readline();

	debug_out(uart3_fifo.line);

	do
	{
		len = modem_readline();
	}
	while(isblankstr(uart3_fifo.line, len) != 1);

	debug_out("data enter\r\n");
	uint16_t _i = 0;
	while(uart3_fifo.num_bytes > 0)
	{
		char c = uart3_getc();
		t->httpdata[_i++] = c;
		_delay_us(10);
	}
	debug_out("data\r\n");
	t->httpdata[_i] = '\0';
	debug_out(t->httpdata);
	debug_out("\r\n");
}